---
type: StructuralSectionUtils
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionUtils

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetStructuralElementDefinitionData | 2015 | `public static StructuralSectionErrorCode GetStructuralElementDefinitionData ( Document document , ElementId elementId , out StructuralElementDefinitionData data )` |
| Method | GetStructuralSection | 2015 | `public static StructuralSection GetStructuralSection ( Document document , ElementId elementId )` |
| Method | SetStructuralSection | 2015 | `public static bool SetStructuralSection ( Document document , ElementId familySymbolId , StructuralSection structuralSection )` |